rukna <- function(){
  year <- 2023
  print("ชื่ออะไรครับ")
  nick <- readLines("stdin",1)
  print(paste("สวัสดีครับ", toupper(nick),"ยินดีที่ได้รู้จักครับ"))
  print("เกิดปีอะไรครับ")
  birtha <- as.numeric(readLines("stdin",1))
  while(is.na(birtha+1)){
    print("ไม่ใช่ครับ พิมพ์เป็นตัวเลข คศ")
    print("เกิดปีอะไรครับ")
    birtha <- as.numeric(readLines("stdin",1))
  }
  age <- year - as.numeric(birtha)
  print(paste("อายุประมาณ", age, "ขวบ นะครับ"))
  
  if(age <= 20){
    print("แรงกำลังดีเลยนะครับ")
  } else if (age <= 30){
    print("สู้ๆนะครับชีวิตกำลังเติบโต")
  } else {
    print("หน้าอ่อนกว่าวัยอีกนะครับ")
  }
  
  sick <- c("ตา","หู","คอ","จมูก")
  cat("อ่าแล้วตอนนี้ต้องการจะตรวจสอบเรื่องอะไรครับ,",toupper(nick),paste(sick, collapse=", "),"?")
  choice <- readLines("stdin",1)
  print(paste("อ่า... เท่าที่สังเกตุอาการณ์นะครับ","น่าจะเป็น"))
  
  encourage <- c("เป็นกำลังใจให้น้า","หายไวๆน้า","สู้ๆน้า")
  
  eye <-c("ตาบอดสี (Color Blindness) เป็นความบกพร่องในการแยกแยะความแตกต่างของสี",
           "ตาแห้ง (Dry Eyes) เป็นโรคตาที่พบได้บ่อยในกลุ่มสูงวัยและในวัยทำงาน มีอาการไม่สบายตา ระคายเคือง เหมือนมีสิ่งแปลกปลอมในตา แสบตาหรืออาจน้ำตาไหลมากได้",
           "จอประสาทตาเสื่อมตามวัย (Age – Related Macular Degeneration: AMD) เกิดจากจุดรับภาพบริเวณกลางจอประสาทตาเสื่อม")
  ear <-c("ทำความสะอาดรูหูบ่อยเกินไปนะครับ จนไปทำให้ข้างในรูหูมันถลอก",
             "เกิดจากเวลาว่ายน้ำหรืออาบน้ำนะครับ มีน้ำเข้าไปในหูมากเกินไป",
             "ใส่หูฟังที่ ขนาดไม่เหมาะสมแล้วไม่สะอาดด้วย ทำให้เป็นฝีในหูนะครับ")
  throat <-c("โรคจมูกอักเสบจากภูมิแพ้ และโรคจมูกอักเสบชนิดไม่แพ้  โรคนี้เกิดจากเยื่อบุจมูกไวผิดปกติ",
             "โรคไซนัสอักเสบเรื้อรัง ทำให้มีอาการคัดจมูกเรื้อรัง ทำให้ต้องหายใจทางปาก เกิดเยื่อบุลำคอแห้ง",
             "การติดเชื้อของลำคอหรือต่อมทอนซิลเรื้อรัง  อาจเกิดจากการติดเชื้อ หรือมีแหล่งของเชื้อโรคอยู่ในช่องปาก เช่น มีฟันผุ หรือโรคเหงือก")
  nose <-c("โรคหวัดหรือไข้หวัด (Acute Rhinopharyngitis : Common Cold) เป็นโรคติดเชื้อที่พบบ่อยมากที่สุดโรคหนึ่ง เกิดจากการติดเชื้อไวรัสซึ่งมีหลายสายพันธุ์ ",
           "ไข้หวัดใหญ่ (Influenza) เป็นโรคติดต่อที่เกิดการระบาดใหญ่เป็นครั้งคราว เกิดจากการติดเชื้อไวรัสอินฟลูเอนซา",
           "โรคปอดอักเสบ หรือที่คนทั่วไปเรียกกันว่า “ปอดบวม” เป็นโรคทางระบบทางเดินหายใจที่เกิดการติดเชื้อบริเวณปอด")
  enough <- ""
  while(toupper(enough) != "NO"){
    if(toupper(choice) == "ENCOURAGE" ){
      print(sample(encourage,1))
    } else if (tolower(choice) == "ตา"){
      print(sample(eye,1))
    } else if (tolower(choice) == "หู"){
      print(sample(ear,1))
    } else if (tolower(choice) == "คอ"){
      print(sample(throat,1))
    } else if (tolower(choice) == "จมูก"){
      print(sample(nose,1))
    } else {
      print("ตอนนี้ ทางโรงพยาบาลว่างแค่ ตา หู คอ จมูก นะครับ")
    }
    print("ตรวจสอบอาการอื่นไหมครับ พิมพ์ no ถ้าไม่อยากตรวจ")
    enough <- readLines("stdin",1)
    if(toupper(enough) != "NO"){
      cat("อยากตรวจสอบอาการไหนครับ",toupper(nick),"คุณ?",paste(sick, collapse=", "),"?")
      print("เลือกมาหนึ่งอย่างครับหรืออยากจะ 'encourage' ")
      choice <- readLines("stdin",1)
    }
  }
  print("เดี๋ยวเชิญชำระเงินที่เคาท์เตอร์ชั้น 2 นะครับ")
}

rukna()
